{"class_name": "Sequential", "backend": "theano", "config": [{"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "name": "dropout_3", "dtype": "float32", "batch_input_shape": [null, 124, 240]}}, {"class_name": "Conv1D", "config": {"name": "conv1d_3", "activity_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "activation": "tanh", "bias_regularizer": null, "use_bias": true, "padding": "same", "dilation_rate": [1], "kernel_size": [25], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "filters": 256}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_size": [2], "name": "max_pooling1d_2", "strides": [2], "padding": "same"}}, {"class_name": "UpSampling1D", "config": {"trainable": true, "name": "up_sampling1d_2", "size": 2}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "name": "dropout_4"}}, {"class_name": "Conv1D", "config": {"name": "conv1d_4", "activity_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "activation": "tanh", "bias_regularizer": null, "use_bias": true, "padding": "same", "dilation_rate": [1], "kernel_size": [25], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "filters": 240}}], "keras_version": "2.0.6"}