{"class_name": "Sequential", "keras_version": "2.0.6", "config": [{"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "name": "dropout_3", "dtype": "float32", "batch_input_shape": [null, 64, 120]}}, {"class_name": "Conv1D", "config": {"dilation_rate": [1], "strides": [1], "bias_constraint": null, "activation": "tanh", "kernel_regularizer": null, "activity_regularizer": null, "filters": 128, "kernel_size": [9], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "use_bias": true, "name": "conv1d_3", "trainable": true, "bias_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"pool_size": [2], "trainable": true, "name": "max_pooling1d_2", "padding": "same", "strides": [2]}}, {"class_name": "Conv1D", "config": {"dilation_rate": [1], "strides": [1], "bias_constraint": null, "activation": "tanh", "kernel_regularizer": null, "activity_regularizer": null, "filters": 120, "kernel_size": [9], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "use_bias": true, "name": "conv1d_4", "trainable": true, "bias_regularizer": null}}, {"class_name": "UpSampling1D", "config": {"trainable": true, "size": 2, "name": "up_sampling1d_2"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "name": "dropout_4"}}], "backend": "theano"}